app/controllers/data_controller.rb

SELECT "docs".* FROM "docs"
---
  def index
  	@items = Doc.all