app/controllers/docs_controller.rb

SELECT  "docs".* FROM "docs"  WHERE "docs"."id" = $1 LIMIT 1  [["id", 24]]
---
  def show
    @doc = Doc.find(params[:id])

INSERT INTO "docs" ("created_at", "info", "parent", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-09-07 22:48:50.552412"], ["info", "test <img1> and <img2>"], ["parent", "Chat"], ["title", "etst"], ["updated_at", "2014-09-07 22:48:50.552412"]]
INSERT INTO "images" ("created_at", "doc_id", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-09-07 21:16:51.288955"], ["doc_id", 24], ["updated_at", "2014-09-07 21:16:51.288955"]]
---
  def create
    @doc = Doc.create!

    @img = @doc.images.build(image: params[:file])

    if @img.save

SELECT  "docs".* FROM "docs"  WHERE "docs"."id" = $1 LIMIT 1  [["id", 15]]
UPDATE "docs" SET "info" = $1, "parent" = $2, "title" = $3, "updated_at" = $4 WHERE "docs"."id" = 89  [["info", "edit <img1> and <img2>"], ["parent", "Chat"], ["title", "Test"], ["updated_at", "2014-09-22 19:34:11.158516"]]
---
  def update
    doc = Doc.find(params[:id])

    if params[:images][0][:imageData]
      decode_image
      doc.update_attributes(@up)

SELECT  "docs".* FROM "docs"  WHERE "docs"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "docs" WHERE "docs"."id" = $1  [["id", 4]]
---
  def destroy
    doc = Doc.find(params[:id])
    doc.destroy