app/controllers/images_controller.rb

INSERT INTO "docs" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2014-09-07 23:28:31.461220"], ["updated_at", "2014-09-07 23:28:31.461220"]]
INSERT INTO "images" ("created_at", "doc_id", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @img = @doc.images.build(image: params[:file])
    if @img.save

SELECT  "docs".* FROM "docs"  WHERE "docs"."id" = $1 LIMIT 1  [["id", 0]]
---
	def find_doc
	  @doc = Doc.find(params[:doc_id])