app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"  WHERE (name ilike '%baked%')
---
  def index
    @recipes = if params[:keywords]
                  Recipe.where('name ilike ?',"%#{params[:keywords]}%")

INSERT INTO "recipes" ("created_at", "instructions", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-08-13 16:03:03.333970"], ["instructions", "Slather in oil, then bake for 20 minutes"], ["name", "Baked Brussel Sprouts"], ["updated_at", "2014-08-13 16:03:03.333970"]]
---
  def create
    @recipe = Recipe.new(params.require(:recipe).permit(:name,:instructions))
    @recipe.save

SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "recipes" SET "instructions" = $1, "name" = $2, "updated_at" = $3 WHERE "recipes"."id" = 1  [["instructions", "Slather in oil, then roast for 20 minutes"], ["name", "Roasted Brussel Sprouts"], ["updated_at", "2014-08-13 16:03:03.867177"]]
---
  def update
    recipe = Recipe.find(params[:id])
    recipe.update_attributes(params.require(:recipe).permit(:name,:instructions))

SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 1]]
---
  def destroy
    recipe = Recipe.find(params[:id])
    recipe.destroy